ARMmbed/mbed-os/targets/TARGET_STM/TARGET_STM32U5/STM32Cube_FW/STM32U5xx_HAL_Driver/stm32u5xx_hal_gfxmmu.c
#if defined(GFXMMU_CR_CE)
/**
  * @brief  This function allows to modify cache and pre-fetch parameters.
  * @param  hgfxmmu GFXMMU handle.
  * @param  CachePrefetch Cache and pre-fetch parameters.
  * @retval HAL status.
  * @note This function is only available on STM32U599/STM32U5A9 devices.
  */
HAL_StatusTypeDef HAL_GFXMMU_ModifyCachePrefetch(GFXMMU_HandleTypeDef *hgfxmmu,
                                                 GFXMMU_CachePrefetchTypeDef *CachePrefetch)
{
  HAL_StatusTypeDef status = HAL_OK;
  assert_param(IS_FUNCTIONAL_STATE(CachePrefetch->Activation));

  /* Check parameters */
  assert_param(IS_GFXMMU_ALL_INSTANCE(hgfxmmu->Instance));

  /* Check GFXMMU state */
  if (hgfxmmu->State != HAL_GFXMMU_STATE_READY)
  {
    status = HAL_ERROR;
  }
  else
  {
    /* Modify cache and pre-fetch parameters on GFXMMU_CR register */
    hgfxmmu->Instance->CR &= ~(GFXMMU_CR_CE | GFXMMU_CR_CL | GFXMMU_CR_CLB | GFXMMU_CR_FC |
                               GFXMMU_CR_PD | GFXMMU_CR_OC | GFXMMU_CR_OB);
    if (CachePrefetch->Activation == ENABLE)
    {
      assert_param(IS_GFXMMU_CACHE_LOCK(CachePrefetch->CacheLock));
      assert_param(IS_GFXMMU_PREFETCH(CachePrefetch->Prefetch));
      assert_param(IS_GFXMMU_OUTTER_BUFFERABILITY(CachePrefetch->OutterBufferability));
      assert_param(IS_GFXMMU_OUTTER_CACHABILITY(CachePrefetch->OutterCachability));
      hgfxmmu->Instance->CR |= (GFXMMU_CR_CE |
                                CachePrefetch->CacheLock |
                                CachePrefetch->Prefetch |
                                CachePrefetch->OutterBufferability |
                                CachePrefetch->OutterCachability);
      if (CachePrefetch->CacheLock == GFXMMU_CACHE_LOCK_ENABLE)
      {
        assert_param(IS_GFXMMU_CACHE_LOCK_BUFFER(CachePrefetch->CacheLockBuffer));
        assert_param(IS_GFXMMU_CACHE_FORCE(CachePrefetch->CacheForce));
        hgfxmmu->Instance->CR |= (CachePrefetch->CacheLockBuffer |
                                  CachePrefetch->CacheForce);
      }
    }
  }
  /* Return function status */
  return status;
}
#endif  /* GFXMMU_CR_CE */

#if defined (GFXMMU_CR_ACE)
/**
  * @brief  This function allows to modify address cache parameters.
  * @param  hgfxmmu GFXMMU handle.
  * @param  address cache parameters.
  * @retval HAL status.
  * @note This function is only available on STM32U5F9/STM32U5G9 devices.
  */
HAL_StatusTypeDef HAL_GFXMMU_ModifyAddressCache(GFXMMU_HandleTypeDef *hgfxmmu,
                                                GFXMMU_AddressCacheTypeDef *AddressCache)
{
  HAL_StatusTypeDef status = HAL_OK;
  assert_param(IS_FUNCTIONAL_STATE(AddressCache->Activation));
  /* Check parameters */
  assert_param(IS_GFXMMU_ALL_INSTANCE(hgfxmmu->Instance));
  /* Check GFXMMU state */
  if (hgfxmmu->State != HAL_GFXMMU_STATE_READY)
  {
    status = HAL_ERROR;
  }
  else
  {
    /* Modify Address cache parameters on GFXMMU_CR register */
    hgfxmmu->Instance->CR &= ~(GFXMMU_CR_ACE | GFXMMU_CR_ACLB);
    if (AddressCache->Activation == ENABLE)
    {
      assert_param(IS_GFXMMU_ADDRESSCACHE_LOCK_BUFFER(AddressCache->AddressCacheLockBuffer));
      hgfxmmu->Instance->CR |= (GFXMMU_CR_ACE |
                                AddressCache->AddressCacheLockBuffer);
    }
  }
  /* Return function status */
  return status;
}
#endif /* GFXMMU_CR_ACE */

/**
  * @brief  This function handles the GFXMMU interrupts.
  * @param  hgfxmmu GFXMMU handle.
  * @retval None.
  */
void HAL_GFXMMU_IRQHandler(GFXMMU_HandleTypeDef *hgfxmmu)
{
  uint32_t flags, interrupts, error;

  /* Read current flags and interrupts and determine which error occurs */
  flags = hgfxmmu->Instance->SR;
  interrupts = (hgfxmmu->Instance->CR & GFXMMU_CR_ITS_MASK);
  error = (flags & interrupts);

  if (error != 0U)
  {
    /* Clear flags on GFXMMU_FCR register */
    hgfxmmu->Instance->FCR = error;

    /* Update GFXMMU error code */
    hgfxmmu->ErrorCode |= error;

    /* Call GFXMMU error callback */
#if (USE_HAL_GFXMMU_REGISTER_CALLBACKS == 1)
    hgfxmmu->ErrorCallback(hgfxmmu);
#else
    HAL_GFXMMU_ErrorCallback(hgfxmmu);
#endif /* USE_HAL_GFXMMU_REGISTER_CALLBACKS == 1 */
  }
}

/**
  * @brief  Error callback.
  * @param  hgfxmmu GFXMMU handle.
  * @retval None.
  */
__weak void HAL_GFXMMU_ErrorCallback(GFXMMU_HandleTypeDef *hgfxmmu)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hgfxmmu);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_GFXMMU_ErrorCallback could be implemented in the user file.
   */
}

/**
  * @}
  */

/** @defgroup GFXMMU_Exported_Functions_Group3 State functions
  *  @brief    GFXMMU state functions
  *
@verbatim
  ==============================================================================
                         ##### State functions #####
  ==============================================================================
    [..]  This section provides functions allowing to:
      (+) Get GFXMMU handle state.
      (+) Get GFXMMU error code.
@endverbatim
  * @{
  */

/**
  * @brief  This function allows to get the current GFXMMU handle state.
  * @param  hgfxmmu GFXMMU handle.
  * @retval GFXMMU state.
  */
HAL_GFXMMU_StateTypeDef HAL_GFXMMU_GetState(GFXMMU_HandleTypeDef *hgfxmmu)
{
  /* Return GFXMMU handle state */
  return hgfxmmu->State;
}

/**
  * @brief  This function allows to get the current GFXMMU error code.
  * @param  hgfxmmu GFXMMU handle.
  * @retval GFXMMU error code.
  */
uint32_t HAL_GFXMMU_GetError(GFXMMU_HandleTypeDef *hgfxmmu)
{
  uint32_t error_code;

  /* Enter in critical section */
  __disable_irq();

  /* Store and reset GFXMMU error code */
  error_code = hgfxmmu->ErrorCode;
  hgfxmmu->ErrorCode = GFXMMU_ERROR_NONE;

  /* Exit from critical section */
  __enable_irq();

  /* Return GFXMMU error code */
  return error_code;
}

/**
  * @}
  */

/**
  * @}
  */
/* End of exported functions -------------------------------------------------*/
/* Private functions ---------------------------------------------------------*/
/* End of private functions --------------------------------------------------*/

/**
  * @}
  */
#endif /* GFXMMU */
#endif /* HAL_GFXMMU_MODULE_ENABLED */
/**
  * @}
  */

